package HW1;

public class Task1_1 {

    public static void main(String[] args) {

        //1. Объявите две переменные: admin и name.
        String admin;
        String name;

        //2. Запишите строку "Ivan" в переменную name.
        name = "Ivan";

        //3. Скопируйте значение из переменной name в admin.
        admin = name;

        //4. Выведите в терминл значение admin
        System.out.println(admin);

    }
}
