package HW2;

public class Task2_1b {
    public static void main(String[] args) throws Exception{
        /*Имеется прямоугольное отверстие размерами a и b.
Определите можно ли его полностью закрыть круглой картонкой радиусом r.
Вывести результат на экран.

Данные a, b и r ввести с консоли.
*/
        System.out.print("Введите радиус r: ");
        int r = System.in.read();

        System.out.print("Введите сторону a: ");
        int a = System.in.read();

        System.out.print("Введите сторону b: ");
        int b = System.in.read();

        /*if (2 *  r >= Math.sqrt(a*a + b*b))
            System.out.println("Можно");
        else
            System.out.println("Нельзя");*/

    }

}
